{
  "version": "1.0",
  "truncation": {
    "direction": "Right",
    "max_length": 128,
    "strategy": "LongestFirst",
    "stride": 0
  },
  "padding": {
    "strategy": {
      "Fixed": 128
    },
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 0,
    "pad_type_id": 0,
    "pad_token": "[PAD]"
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "[CLS]": {
        "id": "[CLS]",
        "ids": [
          2
        ],
        "tokens": [
          "[CLS]"
        ]
      },
      "[SEP]": {
        "id": "[SEP]",
        "ids": [
          3
        ],
        "tokens": [
          "[SEP]"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "#": 4,
      "%": 5,
      "(": 6,
      ")": 7,
      "+": 8,
      "-": 9,
      ".": 10,
      "/": 11,
      "0": 12,
      "1": 13,
      "2": 14,
      "3": 15,
      "4": 16,
      "5": 17,
      "6": 18,
      "7": 19,
      "8": 20,
      "9": 21,
      "=": 22,
      "@": 23,
      "A": 24,
      "B": 25,
      "C": 26,
      "D": 27,
      "E": 28,
      "F": 29,
      "G": 30,
      "H": 31,
      "I": 32,
      "K": 33,
      "L": 34,
      "M": 35,
      "N": 36,
      "O": 37,
      "P": 38,
      "R": 39,
      "S": 40,
      "T": 41,
      "U": 42,
      "V": 43,
      "W": 44,
      "X": 45,
      "Y": 46,
      "Z": 47,
      "[": 48,
      "\\": 49,
      "]": 50,
      "a": 51,
      "b": 52,
      "c": 53,
      "d": 54,
      "e": 55,
      "f": 56,
      "g": 57,
      "h": 58,
      "i": 59,
      "l": 60,
      "m": 61,
      "n": 62,
      "o": 63,
      "p": 64,
      "r": 65,
      "s": 66,
      "t": 67,
      "u": 68,
      "v": 69,
      "y": 70,
      "CC": 71,
      "[C": 72,
      "O)": 73,
      "[C@": 74,
      "H]": 75,
      "H](": 76,
      "[C@@": 77,
      "cc": 78,
      "C(": 79,
      "[C@H](": 80,
      "=O)": 81,
      "CCCC": 82,
      "C)": 83,
      "[C@@H](": 84,
      "[C@H]": 85,
      "[C@@H]": 86,
      "c1": 87,
      "(=O)": 88,
      "[C@H](O)": 89,
      "c(": 90,
      "=C": 91,
      "C(=O)": 92,
      "[C@@H](O)": 93,
      "(C)": 94,
      "=C(": 95,
      "(O)": 96,
      "-]": 97,
      "c2": 98,
      "[O": 99,
      "CCCCCCCC": 100,
      "[O-]": 101,
      "C=C": 102,
      "1O": 103,
      "CO)": 104,
      "CO": 105,
      "/C=C": 106,
      "=N": 107,
      "c1cc": 108,
      "[O-])": 109,
      "O[C@H](": 110,
      "N=C(": 111,
      "P(=O)": 112,
      "c3": 113,
      "O[C@@H]": 114,
      "C(C)": 115,
      "[C@H]2": 116,
      "P(=O)(O)": 117,
      "/C=C\\": 118,
      "O[C@H](CO)": 119,
      "[C@]": 120,
      "OC": 121,
      "c(O)": 122,
      "C(O)": 123,
      "[C@H]1": 124,
      "cn": 125,
      "[C@H]1O": 126,
      "c2cc": 127,
      "CCC": 128,
      "[C@@H]1O": 129,
      "N=C(O)": 130,
      "CC(=O)": 131,
      "[C@H]3": 132,
      "N)": 133,
      "[C@@H](O)[C@H](O)": 134,
      "2)": 135,
      "+]": 136,
      "C(=O)O)": 137,
      "C/C=C\\": 138,
      "[C@@H]2": 139,
      "C(=O)O": 140,
      "[C@@]": 141,
      "C(O)=N": 142,
      "[C@@H]1": 143,
      "P(=O)(O)O": 144,
      "[N": 145,
      "([O-])": 146,
      "CC(C)": 147,
      "[n": 148,
      "ccc1": 149,
      "C1": 150,
      "Cl": 151,
      "[C@@H]3": 152,
      "[C@@H](C)": 153,
      "[C@H](O": 154,
      "cc1": 155,
      "C(C)=C": 156,
      "F)": 157,
      "O[C@@H]2": 158,
      "/C(C)=C": 159,
      "[nH]": 160,
      "CC(O)": 161,
      "c4": 162,
      "c3cc": 163,
      "O=C(": 164,
      "S(=O)": 165,
      "[C@@H](O": 166,
      "[C@H](O)[C@H](O)": 167,
      "c1ccc(": 168,
      "/C=C/": 169,
      "CC[C@]": 170,
      "[C@H]4": 171,
      "CC1": 172,
      "C/C=C\\C/C=C\\": 173,
      "cnc3": 174,
      "N=C(C)": 175,
      "CCCCCCCCCCCCCCCC": 176,
      "COP(=O)(O)O": 177,
      "Cl)": 178,
      "S(=O)(=O)": 179,
      "O)[C@H](O)": 180,
      "c1ccccc1": 181,
      "C(C)(C)": 182,
      "O[C@H](CO)[C@@H](O)[C@H](O)": 183,
      "P(=O)([O-])": 184,
      "P(=O)(O)OC": 185,
      "3)": 186,
      "ccc2": 187,
      "CC(O)=N": 188,
      "=N)": 189,
      "C=C(": 190,
      "[C@@H](n": 191,
      "[C@H](C)": 192,
      "O[C@@H]3": 193,
      "CC/C(C)=C": 194,
      "cc(": 195,
      "CN": 196,
      "N=C(C)O)": 197,
      "C[C@H](O)": 198,
      "OC)": 199,
      "[N+]": 200,
      "=CC": 201,
      "[C@@H]4": 202,
      "CCCCCCCCCCCC": 203,
      "c(N)": 204,
      "12": 205,
      "CCN": 206,
      "CO)O": 207,
      "O=C(O)": 208,
      "C(O)=N[C@@H](": 209,
      "CCO": 210,
      "c5": 211,
      "c2ccccc2": 212,
      ".[": 213,
      "c1n": 214,
      "=O": 215,
      "C[C@H](": 216,
      "c(N)n": 217,
      "[C@H](CO)": 218,
      "[C@H]2O)": 219,
      "O=": 220,
      "c(O)cc": 221,
      "[C@@H](O)[C@@H](O)": 222,
      "[C@H](O)[C@@H]1O": 223,
      "C2": 224,
      "c1cc(": 225,
      "O[C@H](CO": 226,
      "[C@@H](n2": 227,
      "[C@H]1O[C@@H](n2": 228,
      "COP(=O)(O)OP(=O)(O)OC": 229,
      "CC(": 230,
      "[C@H]5": 231,
      "[C@@H]2O)": 232,
      "c2c(": 233,
      "N=C([O-])": 234,
      "4)": 235,
      "N=C(O)[C@H](": 236,
      "cnc32)": 237,
      "cc2": 238,
      "[C@@H](O)[C@H](": 239,
      "[C@H]1O[C@@H](n2cnc3": 240,
      "SCC": 241,
      "S(=O)(=O)O)": 242,
      "C(=O)N": 243,
      "(C)C": 244,
      "cnc32)[C@H](O)[C@@H]1O": 245,
      "CC/C(C)=C\\": 246,
      "[C@H]1O[C@@H](n2cnc3c(N)n": 247,
      "[C@@H](O[C@@H]2": 248,
      "[C@H]1O[C@@H](n2cnc3c(N)ncnc32)[C@H](O)[C@@H]1O": 249,
      "n1": 250,
      "ccc3": 251,
      "c(=O)": 252,
      "O[C@@H]4": 253,
      "[C@H]1CC": 254,
      "Cc1": 255,
      "/C=C(": 256,
      "COP(=O)(O)OP(=O)(O)OC[C@H]1O[C@@H](n2cnc3c(N)ncnc32)[C@H](O)[C@@H]1O": 257,
      "C(=O)[O-])": 258,
      "[C@@H](O)[C@@H]1O": 259,
      "CC(=O)O": 260,
      "2(C)": 261,
      "c2ccc(": 262,
      "[NH": 263,
      "[C@H](O)C(C)(C)": 264,
      "4(C)": 265,
      "(F)": 266,
      "COP(=O)([O-])": 267,
      "P(=O)(O)O)": 268,
      "nc(": 269,
      "C(=N)": 270,
      "CC/C(C)=C\\CC/C(C)=C\\": 271,
      "(C(=O)O)": 272,
      "OC(=O)": 273,
      "C[C@]": 274,
      "cc(O)": 275,
      "c[nH]": 276,
      "CC(=O)O)": 277,
      "=C1": 278,
      "C(=O)[O-]": 279,
      "Cc1cc": 280,
      "CCCC(=O)": 281,
      "\\C)": 282,
      "1)": 283,
      "CC/C(C)=C/": 284,
      "CC)": 285,
      "C(F)": 286,
      ".[C": 287,
      "O[C@H](CO)[C@H](O)[C@H](O)": 288,
      "c1)": 289,
      "O[C@@H](n": 290,
      "CC(O)=N[C@H]1": 291,
      "[C@H](O)[C@@H](O)": 292,
      "[C@H](O)C(C)(C)COP(=O)(O)OP(=O)(O)OC[C@H]1O[C@@H](n2cnc3c(N)ncnc32)[C@H](O)[C@@H]1O": 293,
      "[C@@H](CO)O": 294,
      "c2)": 295,
      "CCC(=O)O)": 296,
      "c(C)": 297,
      "=C(C)": 298,
      "c1ccccc1)": 299,
      "(C)C)": 300,
      "[C@H]3O)": 301,
      "c3ccccc3": 302,
      "/C=C(\\C)": 303,
      "O[C@@H](C)": 304,
      "CCCN": 305,
      "C[C@@H](O)": 306,
      "CC/C=C\\": 307,
      "cc3": 308,
      "O[C@H](CO)[C@@H](": 309,
      "C(C)=O)": 310,
      "CCCCCCCC(=O)": 311,
      "c2ccccc2)": 312,
      "COC(=O)": 313,
      "OC[C@H]1O": 314,
      "O=C([O-])": 315,
      "C(F)(F)": 316,
      "CC[C@@]": 317,
      "c4cc": 318,
      "[N+](C)": 319,
      "c(OC)": 320,
      "Br": 321,
      "12C": 322,
      "[C@@H]5": 323,
      "3(C)": 324,
      "(C)(": 325,
      "c(O)c(O)": 326,
      "[C@H](O[C@H]2": 327,
      "c(Cl)": 328,
      "CS": 329,
      "C=": 330,
      "c1O": 331,
      "c(-": 332,
      "C[C@@H]1O": 333,
      "C3": 334,
      "N=C(O)CC": 335,
      "C(C)C)": 336,
      "[C@H]1CC[C@H]2": 337,
      ".O": 338,
      ".[N": 339,
      "C=C1": 340,
      "1(C)": 341,
      "c(O)n": 342,
      "CCN(": 343,
      "O[C@@H]1": 344,
      "4(C)[C@H]3": 345,
      "CC(C)=": 346,
      "COc1cc": 347,
      "/C(": 348,
      "[C@@H](O)[C@H](O": 349,
      "C[C@@H]1": 350,
      "cc1)": 351,
      "a+]": 352,
      "C[C@@H](": 353,
      "COP(=O)([O-])O": 354,
      ".[Na+]": 355,
      "[C@H]6": 356,
      "CCCCCCCCCC": 357,
      "/C(C)=C/": 358,
      "COc1cc(": 359,
      "c2n": 360,
      "cc2)": 361,
      "cnc5": 362,
      "C[C@@]": 363,
      "N=C(O)[C@@H](": 364,
      "2]": 365,
      "[C@@H]1O[C@H](CO)": 366,
      "[C@H](N)": 367,
      "O[C@H](CO)[C@H](O)": 368,
      "CCCCC/C=C\\C/C=C\\": 369,
      "CCCC(C)": 370,
      "C=C(C)": 371,
      "=CC(=O)": 372,
      "[C@@H]3O)": 373,
      "CCC(": 374,
      "CC[C@]4(C)[C@H]3": 375,
      "CC(C)=CCC": 376,
      "N=": 377,
      "[N+](=O)": 378,
      "C[C@H](O)[C@@H](": 379,
      "O[C@@H]5": 380,
      "[C@H](O)[C@@H](": 381,
      "CC(O)=N[C@@H]1": 382,
      "3+]": 383,
      "C=CC": 384,
      "[C@H]1O)": 385,
      "c1ncn": 386,
      "[NH3+]": 387,
      "[C@@H]3O": 388,
      "N[C@@H](": 389,
      "O[C@@H]1O": 390,
      "N=C([O-])CC": 391,
      "CCCCCC": 392,
      "c2c1": 393,
      "C=C\\": 394,
      "[C@H]1CC[C@H]2[C@@H]3": 395,
      ".[O": 396,
      "c([O-])": 397,
      "CC/C=C(\\C)": 398,
      "P(=O)([O-])[O-]": 399,
      "Br)": 400,
      "C[C@H]1O": 401,
      "c6": 402,
      "[C@H]3O[C@@H](n": 403,
      "N=C(O)CCN=C(O)": 404,
      "C/C=C/": 405,
      "[C@H]3O[C@@H](n4": 406,
      "SCCN=C(O)CCN=C(O)": 407,
      "[C@H](O[C@@H]2": 408,
      "O=C1": 409,
      "CCCCCCC": 410,
      "[C@@H]4O)": 411,
      "[C@@H](O)[C@H]1O": 412,
      "[S": 413,
      "[C@@H](O[C@H]2": 414,
      "-].[": 415,
      "CC/C(C)=C/CC/C(C)=C/": 416,
      "c(=N)": 417,
      "c2cc(": 418,
      "CCOCCO": 419,
      "5)": 420,
      "SCCN=C([O-])CC": 421,
      "SCCN=C([O-])CCN=C([O-])": 422,
      "+2]": 423,
      "O[C@@H](C)[C@@H](O)[C@@H](O)": 424,
      "(O)(": 425,
      "[C@H]4O[C@H](CO)[C@@H](O)[C@H](O)": 426,
      "[C@H]2O": 427,
      "Cc1cn": 428,
      "CN1": 429,
      "CCCCCCCC/C=C\\": 430,
      "[C@@H](O)[C@H](O)[C@H]1O": 431,
      "CC[C@]12C": 432,
      "N1": 433,
      "N=C": 434,
      "[C@@H](CO)": 435,
      "[O-])=N": 436,
      "N(": 437,
      "CC[N+](C)": 438,
      "[C@H]4O)": 439,
      "CC1(C)": 440,
      "CC(C)C)": 441,
      "%1": 442,
      "S)": 443,
      "[N+](=O)[O-])": 444,
      "SCCN=C(O)CCN=C(O)[C@H](O)C(C)(C)COP(=O)(O)OP(=O)(O)OC[C@H]1O[C@@H](n2cnc3c(N)ncnc32)[C@H](O)[C@@H]1O": 445,
      "23": 446,
      "C(O)=N[C@H](": 447,
      "Cc1ccc(": 448,
      "CC(=O)[O-])": 449,
      "/C(=C": 450,
      "[C@@H](CO": 451,
      "SCCN=C([O-])CCN=C([O-])[C@H](O)C(C)(C)COP(=O)(O)OP(=O)(O)OC[C@H]1O[C@@H](n2cnc3c(N)ncnc32)[C@H](O)[C@@H]1O": 452,
      ".O.O": 453,
      "OC[C@H](": 454,
      "S(=O)(=O)[O-])": 455,
      "COc1ccc(": 456,
      "c2[nH]": 457,
      "CC(C)=CCC/C(C)=C/": 458,
      "cc4": 459,
      "CC[C@@H]1": 460,
      "C(=N)O)": 461,
      "CCCCCCCCCCCCCC": 462,
      "[C@]3": 463,
      "c2ccccc1": 464,
      "CC/C(C)=C\\CC/C(C)=C\\CC/C(C)=C\\CC/C(C)=C\\": 465,
      "Cc1ccccc1)": 466,
      "[C@@H]2O": 467,
      "SCCN=C(O)CCN=C(O)[C@H](O)C(C)(C)COP(=O)(O)OP(=O)(O)OC[C@H]1O[C@@H](n2cnc3c(N)ncnc32)[C@H](O)[C@@H]1OP(=O)(O)O": 468,
      "O[C@H](CO)[C@@H](O)": 469,
      "P(=O)([O-])[O-])": 470,
      ".[Cl": 471,
      "[C@H]2O)[C@H](O)": 472,
      ".[O]": 473,
      "c12": 474,
      "O=P": 475,
      "CCCCC": 476,
      "COP(=O)([O-])OCC[N+](C)": 477,
      "c3ccccc3)": 478,
      "N2": 479,
      "CCS": 480,
      "C#": 481,
      "[C@@](C)(": 482,
      "P(=O)(O)OC[C@H]3O[C@@H](n4": 483,
      "SCCN=C([O-])CCN=C([O-])[C@H](O)C(C)(C)COP(=O)(O)OP(=O)(O)OC[C@H]1O[C@@H](n2cnc3c(N)ncnc32)[C@H](O)[C@@H]1OP(=O)([O-])[O-]": 484,
      "c3c(": 485,
      "[C@H]1O[C@H](CO)": 486,
      "c2cc(O)": 487,
      "CC(C)(C)": 488,
      "c3ccc(": 489,
      "[C@H](O)[C@H](O)CO)O": 490,
      "CCC(=O)[O-])": 491,
      "cc(C)": 492,
      ".Cl": 493,
      "c1ccc(O)": 494,
      "1(O)": 495,
      "C=O)": 496,
      "C1=C": 497,
      "[C@H]([C@H](O)[C@H](O)CO)O": 498,
      "2(": 499,
      "[C@@H](O[C@H]3": 500,
      "O=S(=O)": 501,
      "C(F)(F)F)": 502,
      "C(C)C": 503,
      "C[C@@H]3O": 504,
      "CCC(=O)": 505,
      "n4": 506,
      "c(O)cc(O)": 507,
      "/C=C/C=C\\": 508,
      "[C@H]2N=C(C)O)": 509,
      "CC/C=C\\C/C=C\\C/C=C\\": 510,
      "C[C@H]1": 511,
      "O[C@@H]2CO)": 512,
      "c2c(c1)": 513,
      "O1": 514,
      "c3)": 515,
      "O[C@H](CO)[C@@H](O)[C@@H]1O": 516,
      "2c(": 517,
      "[C@@H]([C@H](O)": 518,
      "O[C@H](C)": 519,
      "nc(=N)": 520,
      "C[C@H](N)": 521,
      "CC(C)(": 522,
      "nc(=N)[nH]": 523,
      "5(C)": 524,
      "O[C@@H]6": 525,
      "].[": 526,
      "C[C@@H](C)": 527,
      "CCC1": 528,
      "[NH3+])": 529,
      "[C@H]3N=C(C)O)": 530,
      "(C(=O)O)C[C@H](O)[C@@H](": 531,
      "C(=O)N1": 532,
      "[C@@H]1CC": 533,
      "CC(=N)": 534,
      "c(O)c(": 535,
      "c2ccc(O)cc": 536,
      "C1=O": 537,
      "CCCCCCCCCCCCCCC": 538,
      ".[Cl-]": 539,
      "c1c(": 540,
      "(C)(O)": 541,
      "c2cc3": 542,
      "[C@@H]1O[C@H](": 543,
      "c(=N)n": 544,
      "[C@H]7": 545,
      "O2)": 546,
      "ccc1O": 547,
      "n2": 548,
      "cc1O": 549,
      "([O-])=N": 550,
      "1(": 551,
      "CCCCCCCCCCC)": 552,
      "O[C@H](CO)[C@H](O)[C@H](": 553,
      "N=C(O)C": 554,
      "=C(C)C)": 555,
      "COP(=O)(O)O[C@H]3": 556,
      "CN(C)": 557,
      "O[C@H](COC(=O)": 558,
      "n(": 559,
      "N=c1n": 560,
      "[C@H]2O[C@@H](n": 561,
      "[C@H]2O[C@@H](n3": 562,
      "c(O)nc(=N)[nH]": 563,
      "CC(O)=N[C@H]1[C@H](O[C@H]2": 564,
      "O[C@H](CO)[C@@H](O[C@@H]3": 565,
      "O=C": 566,
      "=C2": 567,
      "[C@H]3O[C@H](CO)[C@@H](O)[C@H](O)": 568,
      "[C@@H](O)[C@H](O[C@@H]2": 569,
      "C[C@H]2": 570,
      "(C(=O)O)C[C@H](O)[C@@H](N=C(C)O)": 571,
      "c5cc": 572,
      "cc(OC)": 573,
      "c[nH]c2ccccc1": 574,
      "c1cc(O)": 575,
      "CC[C@]2(C)": 576,
      "CC/C=C(\\C)CC/C=C(\\C)": 577,
      "(O)O": 578,
      "CC[C@]4(C)[C@H]3CC[C@]12C": 579,
      "N=C(O)[C@@H](N)": 580,
      "[C@H]4O[C@H](CO)[C@@H](O)[C@H](O)[C@@H]4": 581,
      "2+]": 582,
      "C(=N)N)": 583,
      "C[C@]12": 584,
      "[C@@H](CO)O[C@H]1O": 585,
      "c3cc(": 586,
      "CCCC(=O)O": 587,
      "C[C@H](O": 588,
      "ccc4": 589,
      "[C@H](O)[C@H](O)[C@H]1O": 590,
      "O[C@H](CO)[C@@H](O[C@@H]2": 591,
      "CC[C@H](C)": 592,
      "CC2": 593,
      "[n+]": 594,
      "c3cc(O)": 595,
      "[NH2+]": 596,
      "CCC(=O)O": 597,
      "CCCCC/C=C\\C/C=C\\C/C=C\\C/C=C\\": 598,
      "CCC(O)=N": 599,
      "CCCCCCCCCCCCCCCCCCCCCCCC": 600,
      "CN(": 601,
      "C[C@@H]3OP(=O)(O)OC[C@H]3O[C@@H](n4": 602,
      "CC(=N)O)": 603,
      "3]": 604,
      "CC(=O)[O-]": 605,
      "[C@@]2(C)": 606,
      "cnc4": 607,
      "O[C@@H]3CO)": 608,
      "c2ccc(O)cc2)": 609,
      "CC[C@H]1": 610,
      "CCCCN)": 611,
      "CCC(C)": 612,
      "O[C@@H]3COP(=O)(O)O[C@H]3": 613,
      "cs": 614,
      "[C@H]4N=C(C)O)": 615,
      "O[C@@H](C)[C@@H](O)[C@@H](O)[C@@H]2O)": 616,
      "C[C@@H]4": 617,
      "[nH]c(": 618,
      "C(=O)N2": 619,
      ".[O].[O]": 620,
      "[C@H](OC": 621,
      "[C@@H](OC(=O)": 622,
      "(C(=O)O)C[C@H](O)[C@@H](N=C(C)O)[C@H]([C@H](O)[C@H](O)CO)O": 623,
      "/C=C/C(C)=C": 624,
      "CCN1": 625,
      "ccc(=N)n": 626,
      "CCC[C@H]1": 627,
      "C[C@@H]2": 628,
      "OC(": 629,
      "c4=O)": 630,
      "[C@H](O[C@H]3": 631,
      "CC(O)=N[C@@H](": 632,
      "=S)": 633,
      "C2)": 634,
      "c1ccc(Cl)": 635,
      "c(=O)n": 636,
      "C(F)(F)C(F)(F)": 637,
      "21": 638,
      "O[C@H](CO)[C@@H](O)[C@H](O)[C@H]2O)": 639,
      "[C@@H](O)[C@@H](CO)O": 640,
      "CCCCCCC/C=C\\": 641,
      "c(O)c1": 642,
      "c(O)nc4=O)": 643,
      "CCCCCCCC/C=C\\CCCCCCCC(=O)": 644,
      "/C(=C\\": 645,
      "CC[C@H](": 646,
      "Cc1ccc(O)": 647,
      "OC1": 648,
      "[C@@H]([C@H](O)CO)O": 649,
      "F-].[": 650,
      "C(=CC": 651,
      "[C@@H](O)[C@@H](O)[C@@H]1O": 652,
      "CO[C@@H]1O[C@H](CO)": 653,
      "OCO": 654,
      "C([O-])=N": 655,
      "[N+]([O-])": 656,
      "c1ncn2": 657,
      "cc3)": 658,
      "c1cccc(": 659,
      "N(C)": 660,
      "c2c1ncn2": 661,
      "CCCCCCCCCCCCCCCC(=O)": 662,
      "Cc1n": 663,
      "I)": 664,
      "CC2)": 665,
      "[C@H]5O)": 666,
      ".[Na+].[Na+]": 667,
      "Cn1": 668,
      "C[N+](C)": 669,
      "[C@@]1(C)": 670,
      "CC(O)=N[C@@H]1[C@@H](O)[C@H](O[C@@H]2": 671,
      "[C@@H](C)[C@H]1CC[C@H]2[C@@H]3": 672,
      "O[C@@H]3O[C@H](CO)[C@@H](O)[C@H](O)": 673,
      "P(=O)(O)O)[C@@H](O)": 674,
      "n2)": 675,
      "=CCCC(C)": 676,
      "C(=O)OC)": 677,
      "CCSC(=O)": 678,
      "[2": 679,
      "o+]": 680,
      "CCC4": 681,
      "CC[C@]3(C)": 682,
      "CC(C)(COP(=O)(O)OP(=O)(O)OC[C@H]1O[C@@H](n2cnc3c(N)ncnc32)[C@H](O)[C@@H]1O": 683,
      "c2ccccc21": 684,
      "#N": 685,
      "OC[C@@H](O)": 686,
      "O)C(=O)": 687,
      "O3)": 688,
      "CC([O-])=N": 689,
      "[C@]3(C)": 690,
      "O=[N+]([O-])": 691,
      "CC[C@H](O)": 692,
      "cn(": 693,
      "([O-])([O-])": 694,
      "[C@](C)(": 695,
      "[C@]1(C)": 696,
      "COP(=O)(O)OP(=O)(O)O": 697,
      "NC(": 698,
      "[C@@H](N)": 699,
      "[C@@H](O)CO)": 700,
      "[C@@H](OC(C)=O)": 701,
      "-c2cc": 702,
      "OO": 703,
      "CC[C@H]2": 704,
      "CCCCCCCCCCCCCCCCCCCC": 705,
      "CCCNC(=N)N)": 706,
      "Cc1cn(": 707,
      "3C)": 708,
      "Fe": 709,
      "O)[C@H](O)[C@H]2N=C(C)O)": 710,
      "CC[C@H]3": 711,
      "C1)": 712,
      "CCOC(=O)": 713,
      "(O)=N": 714,
      "[C@H]1N=C(C)": 715,
      "CCCCCCCCCCCCC/C=C/": 716,
      "Cc1c[nH]c2ccccc1": 717,
      "cnc54)": 718,
      ".N": 719,
      "2(O)": 720,
      "Cc1cc(": 721,
      "Nc1ncn": 722,
      "[A": 723,
      "[C@@H]6": 724,
      "[C@H]2O)[C@@H]1O": 725,
      "[o+]": 726,
      "[C@]2(C)": 727,
      "[C@@H](O)[C@H](O)[C@@H]1O": 728,
      "P(=O)(O)OP(=O)(O)OC": 729,
      "(C(=O)O)C": 730,
      "CCC([O-])=N": 731,
      "N=N": 732,
      "[NH+]": 733,
      "[C@@H]5O)": 734,
      "CC/C=C\\C/C=C\\C/C=C\\C/C=C\\C/C=C\\": 735,
      "[C@H](O)[C@@H](O)[C@@H]1O": 736,
      "+3]": 737,
      "[C@@H]2O)[C@H](O)": 738,
      "[nH]1": 739,
      "CC1=C(": 740,
      "[2H]": 741,
      "COP(=O)(O)O)": 742,
      "S(=O)(=O)O": 743,
      "c(N)ncnc54)": 744,
      "cnc5c(N)ncnc54)": 745,
      "[C@@H](OC": 746,
      "O[C@H](C(=O)O)": 747,
      "CC[C@]4": 748,
      "COP(=O)([O-])OCC[N+](C)(C)C": 749,
      "Cc1ccc(O)cc1)": 750,
      "C(=O)O)C(=O)O": 751,
      "[C@@]3": 752,
      "N(C)C)": 753,
      "co": 754,
      "CC=C": 755,
      "C(=O)OC": 756,
      "c1ccc(O)c(O)": 757,
      "C(O)=N[C@@H](C)": 758,
      "O[C@@H]4O[C@H](CO)[C@@H](O)[C@H](O)": 759,
      "CCC(=N)O)": 760,
      "CC(C)=CCC/C(C)=C/CC/C(C)=C/": 761,
      "CC[C@@H]4": 762,
      "CC=C(C)C)": 763,
      "c4ccccc4": 764,
      "C[C@H](C)": 765,
      "c1ccc2c(c1)": 766,
      "O=P(O)": 767,
      "cc(C)c(O)nc4=O)": 768,
      "CSCC": 769,
      "COP(=O)([O-])OCC[N+](C)(C)C)": 770,
      "[C@@](": 771,
      "CC[C@]12": 772,
      "c4O)": 773,
      "C(O)=N[C@@H](CO)": 774,
      "C[C@H]3": 775,
      "O[C@@H]7": 776,
      "[C@@H](C)O)": 777,
      "F-].[F-].[": 778,
      "=CCCC(C)=CCCC(C)": 779,
      "CCO)": 780,
      "[C@H](O)CO": 781,
      "N#": 782,
      "]#N": 783,
      "c1c(C)": 784,
      "c3=O)": 785,
      "C(C)=O": 786,
      "CCCN1": 787,
      "[Si": 788,
      "C#N)": 789,
      "C=C2": 790,
      "N=C(N)": 791,
      "[C@@H](O)[C@H](O)[C@H]1O)": 792,
      "[C@@H](O)[C@H](n4": 793,
      "C(=O)N1CCC[C@H]1": 794,
      "O[C@@H]1O[C@H](CO)": 795,
      "c1ccc(O)cc1": 796,
      "-c2": 797,
      "C4": 798,
      "Cc1ccccc1": 799
    },
    "merges": [
      [
        "C",
        "C"
      ],
      [
        "[",
        "C"
      ],
      [
        "O",
        ")"
      ],
      [
        "[C",
        "@"
      ],
      [
        "H",
        "]"
      ],
      [
        "H]",
        "("
      ],
      [
        "[C@",
        "@"
      ],
      [
        "c",
        "c"
      ],
      [
        "C",
        "("
      ],
      [
        "[C@",
        "H]("
      ],
      [
        "=",
        "O)"
      ],
      [
        "CC",
        "CC"
      ],
      [
        "C",
        ")"
      ],
      [
        "[C@@",
        "H]("
      ],
      [
        "[C@",
        "H]"
      ],
      [
        "[C@@",
        "H]"
      ],
      [
        "c",
        "1"
      ],
      [
        "(",
        "=O)"
      ],
      [
        "[C@H](",
        "O)"
      ],
      [
        "c",
        "("
      ],
      [
        "=",
        "C"
      ],
      [
        "C(",
        "=O)"
      ],
      [
        "[C@@H](",
        "O)"
      ],
      [
        "(",
        "C)"
      ],
      [
        "=",
        "C("
      ],
      [
        "(",
        "O)"
      ],
      [
        "-",
        "]"
      ],
      [
        "c",
        "2"
      ],
      [
        "[",
        "O"
      ],
      [
        "CCCC",
        "CCCC"
      ],
      [
        "[O",
        "-]"
      ],
      [
        "C",
        "=C"
      ],
      [
        "1",
        "O"
      ],
      [
        "C",
        "O)"
      ],
      [
        "C",
        "O"
      ],
      [
        "/",
        "C=C"
      ],
      [
        "=",
        "N"
      ],
      [
        "c1",
        "cc"
      ],
      [
        "[O-]",
        ")"
      ],
      [
        "O",
        "[C@H]("
      ],
      [
        "N",
        "=C("
      ],
      [
        "P",
        "(=O)"
      ],
      [
        "c",
        "3"
      ],
      [
        "O",
        "[C@@H]"
      ],
      [
        "C(",
        "C)"
      ],
      [
        "[C@H]",
        "2"
      ],
      [
        "P(=O)",
        "(O)"
      ],
      [
        "/C=C",
        "\\"
      ],
      [
        "O[C@H](",
        "CO)"
      ],
      [
        "[C@",
        "]"
      ],
      [
        "O",
        "C"
      ],
      [
        "c(",
        "O)"
      ],
      [
        "C(",
        "O)"
      ],
      [
        "[C@H]",
        "1"
      ],
      [
        "c",
        "n"
      ],
      [
        "[C@H]",
        "1O"
      ],
      [
        "c2",
        "cc"
      ],
      [
        "CC",
        "C"
      ],
      [
        "[C@@H]",
        "1O"
      ],
      [
        "N=C(",
        "O)"
      ],
      [
        "CC",
        "(=O)"
      ],
      [
        "[C@H]",
        "3"
      ],
      [
        "N",
        ")"
      ],
      [
        "[C@@H](O)",
        "[C@H](O)"
      ],
      [
        "2",
        ")"
      ],
      [
        "+",
        "]"
      ],
      [
        "C(=O)",
        "O)"
      ],
      [
        "C",
        "/C=C\\"
      ],
      [
        "[C@@H]",
        "2"
      ],
      [
        "C(=O)",
        "O"
      ],
      [
        "[C@@",
        "]"
      ],
      [
        "C(O)",
        "=N"
      ],
      [
        "[C@@H]",
        "1"
      ],
      [
        "P(=O)(O)",
        "O"
      ],
      [
        "[",
        "N"
      ],
      [
        "(",
        "[O-])"
      ],
      [
        "CC",
        "(C)"
      ],
      [
        "[",
        "n"
      ],
      [
        "cc",
        "c1"
      ],
      [
        "C",
        "1"
      ],
      [
        "C",
        "l"
      ],
      [
        "[C@@H]",
        "3"
      ],
      [
        "[C@@H](",
        "C)"
      ],
      [
        "[C@H](",
        "O"
      ],
      [
        "cc",
        "1"
      ],
      [
        "C(C)",
        "=C"
      ],
      [
        "F",
        ")"
      ],
      [
        "O[C@@H]",
        "2"
      ],
      [
        "/",
        "C(C)=C"
      ],
      [
        "[n",
        "H]"
      ],
      [
        "CC",
        "(O)"
      ],
      [
        "c",
        "4"
      ],
      [
        "c3",
        "cc"
      ],
      [
        "O",
        "=C("
      ],
      [
        "S",
        "(=O)"
      ],
      [
        "[C@@H](",
        "O"
      ],
      [
        "[C@H](O)",
        "[C@H](O)"
      ],
      [
        "c1cc",
        "c("
      ],
      [
        "/C=C",
        "/"
      ],
      [
        "CC",
        "[C@]"
      ],
      [
        "[C@H]",
        "4"
      ],
      [
        "CC",
        "1"
      ],
      [
        "C/C=C\\",
        "C/C=C\\"
      ],
      [
        "cn",
        "c3"
      ],
      [
        "N=C(",
        "C)"
      ],
      [
        "CCCCCCCC",
        "CCCCCCCC"
      ],
      [
        "CO",
        "P(=O)(O)O"
      ],
      [
        "Cl",
        ")"
      ],
      [
        "S(=O)",
        "(=O)"
      ],
      [
        "O)",
        "[C@H](O)"
      ],
      [
        "c1cc",
        "ccc1"
      ],
      [
        "C(C)",
        "(C)"
      ],
      [
        "O[C@H](CO)",
        "[C@@H](O)[C@H](O)"
      ],
      [
        "P(=O)",
        "([O-])"
      ],
      [
        "P(=O)(O)",
        "OC"
      ],
      [
        "3",
        ")"
      ],
      [
        "cc",
        "c2"
      ],
      [
        "CC(O)",
        "=N"
      ],
      [
        "=N",
        ")"
      ],
      [
        "C",
        "=C("
      ],
      [
        "[C@@H](",
        "n"
      ],
      [
        "[C@H](",
        "C)"
      ],
      [
        "O[C@@H]",
        "3"
      ],
      [
        "CC",
        "/C(C)=C"
      ],
      [
        "cc",
        "("
      ],
      [
        "C",
        "N"
      ],
      [
        "N=C(C)",
        "O)"
      ],
      [
        "C",
        "[C@H](O)"
      ],
      [
        "O",
        "C)"
      ],
      [
        "[N",
        "+]"
      ],
      [
        "=",
        "CC"
      ],
      [
        "[C@@H]",
        "4"
      ],
      [
        "CCCCCCCC",
        "CCCC"
      ],
      [
        "c(",
        "N)"
      ],
      [
        "1",
        "2"
      ],
      [
        "CC",
        "N"
      ],
      [
        "CO)",
        "O"
      ],
      [
        "O=C(",
        "O)"
      ],
      [
        "C(O)=N",
        "[C@@H]("
      ],
      [
        "CC",
        "O"
      ],
      [
        "c",
        "5"
      ],
      [
        "c2cc",
        "ccc2"
      ],
      [
        ".",
        "["
      ],
      [
        "c1",
        "n"
      ],
      [
        "=",
        "O"
      ],
      [
        "C",
        "[C@H]("
      ],
      [
        "c(N)",
        "n"
      ],
      [
        "[C@H](",
        "CO)"
      ],
      [
        "[C@H]2",
        "O)"
      ],
      [
        "O",
        "="
      ],
      [
        "c(O)",
        "cc"
      ],
      [
        "[C@@H](O)",
        "[C@@H](O)"
      ],
      [
        "[C@H](O)",
        "[C@@H]1O"
      ],
      [
        "C",
        "2"
      ],
      [
        "c1cc",
        "("
      ],
      [
        "O[C@H](",
        "CO"
      ],
      [
        "[C@@H](n",
        "2"
      ],
      [
        "[C@H]1O",
        "[C@@H](n2"
      ],
      [
        "COP(=O)(O)O",
        "P(=O)(O)OC"
      ],
      [
        "CC",
        "("
      ],
      [
        "[C@H]",
        "5"
      ],
      [
        "[C@@H]2",
        "O)"
      ],
      [
        "c2",
        "c("
      ],
      [
        "N=C(",
        "[O-])"
      ],
      [
        "4",
        ")"
      ],
      [
        "N=C(O)",
        "[C@H]("
      ],
      [
        "cnc3",
        "2)"
      ],
      [
        "cc",
        "2"
      ],
      [
        "[C@@H](O)",
        "[C@H]("
      ],
      [
        "[C@H]1O[C@@H](n2",
        "cnc3"
      ],
      [
        "S",
        "CC"
      ],
      [
        "S(=O)(=O)",
        "O)"
      ],
      [
        "C(=O)",
        "N"
      ],
      [
        "(C)",
        "C"
      ],
      [
        "cnc32)",
        "[C@H](O)[C@@H]1O"
      ],
      [
        "CC/C(C)=C",
        "\\"
      ],
      [
        "[C@H]1O[C@@H](n2cnc3",
        "c(N)n"
      ],
      [
        "[C@@H](",
        "O[C@@H]2"
      ],
      [
        "[C@H]1O[C@@H](n2cnc3c(N)n",
        "cnc32)[C@H](O)[C@@H]1O"
      ],
      [
        "n",
        "1"
      ],
      [
        "cc",
        "c3"
      ],
      [
        "c",
        "(=O)"
      ],
      [
        "O[C@@H]",
        "4"
      ],
      [
        "[C@H]1",
        "CC"
      ],
      [
        "C",
        "c1"
      ],
      [
        "/",
        "C=C("
      ],
      [
        "COP(=O)(O)OP(=O)(O)OC",
        "[C@H]1O[C@@H](n2cnc3c(N)ncnc32)[C@H](O)[C@@H]1O"
      ],
      [
        "C(=O)",
        "[O-])"
      ],
      [
        "[C@@H](O)",
        "[C@@H]1O"
      ],
      [
        "CC(=O)",
        "O"
      ],
      [
        "2",
        "(C)"
      ],
      [
        "c2cc",
        "c("
      ],
      [
        "[N",
        "H"
      ],
      [
        "[C@H](O)",
        "C(C)(C)"
      ],
      [
        "4",
        "(C)"
      ],
      [
        "(",
        "F)"
      ],
      [
        "CO",
        "P(=O)([O-])"
      ],
      [
        "P(=O)(O)",
        "O)"
      ],
      [
        "n",
        "c("
      ],
      [
        "C(",
        "=N)"
      ],
      [
        "CC/C(C)=C\\",
        "CC/C(C)=C\\"
      ],
      [
        "(",
        "C(=O)O)"
      ],
      [
        "O",
        "C(=O)"
      ],
      [
        "C",
        "[C@]"
      ],
      [
        "cc",
        "(O)"
      ],
      [
        "c",
        "[nH]"
      ],
      [
        "CC(=O)",
        "O)"
      ],
      [
        "=C",
        "1"
      ],
      [
        "C(=O)",
        "[O-]"
      ],
      [
        "C",
        "c1cc"
      ],
      [
        "CCCC",
        "(=O)"
      ],
      [
        "\\",
        "C)"
      ],
      [
        "1",
        ")"
      ],
      [
        "CC/C(C)=C",
        "/"
      ],
      [
        "CC",
        ")"
      ],
      [
        "C(",
        "F)"
      ],
      [
        ".",
        "[C"
      ],
      [
        "O[C@H](CO)",
        "[C@H](O)[C@H](O)"
      ],
      [
        "c1",
        ")"
      ],
      [
        "O",
        "[C@@H](n"
      ],
      [
        "CC(O)=N",
        "[C@H]1"
      ],
      [
        "[C@H](O)",
        "[C@@H](O)"
      ],
      [
        "[C@H](O)C(C)(C)",
        "COP(=O)(O)OP(=O)(O)OC[C@H]1O[C@@H](n2cnc3c(N)ncnc32)[C@H](O)[C@@H]1O"
      ],
      [
        "[C@@H](",
        "CO)O"
      ],
      [
        "c2",
        ")"
      ],
      [
        "CC",
        "C(=O)O)"
      ],
      [
        "c(",
        "C)"
      ],
      [
        "=C(",
        "C)"
      ],
      [
        "c1ccccc1",
        ")"
      ],
      [
        "(C)",
        "C)"
      ],
      [
        "[C@H]3",
        "O)"
      ],
      [
        "c3cc",
        "ccc3"
      ],
      [
        "/C=C(",
        "\\C)"
      ],
      [
        "O",
        "[C@@H](C)"
      ],
      [
        "CCC",
        "N"
      ],
      [
        "C",
        "[C@@H](O)"
      ],
      [
        "CC",
        "/C=C\\"
      ],
      [
        "cc",
        "3"
      ],
      [
        "O[C@H](CO)",
        "[C@@H]("
      ],
      [
        "C(C)",
        "=O)"
      ],
      [
        "CCCCCCCC",
        "(=O)"
      ],
      [
        "c2ccccc2",
        ")"
      ],
      [
        "CO",
        "C(=O)"
      ],
      [
        "OC",
        "[C@H]1O"
      ],
      [
        "O=C(",
        "[O-])"
      ],
      [
        "C(F)",
        "(F)"
      ],
      [
        "CC",
        "[C@@]"
      ],
      [
        "c4",
        "cc"
      ],
      [
        "[N+]",
        "(C)"
      ],
      [
        "c(",
        "OC)"
      ],
      [
        "B",
        "r"
      ],
      [
        "12",
        "C"
      ],
      [
        "[C@@H]",
        "5"
      ],
      [
        "3",
        "(C)"
      ],
      [
        "(C)",
        "("
      ],
      [
        "c(O)",
        "c(O)"
      ],
      [
        "[C@H](O",
        "[C@H]2"
      ],
      [
        "c(",
        "Cl)"
      ],
      [
        "C",
        "S"
      ],
      [
        "C",
        "="
      ],
      [
        "c1",
        "O"
      ],
      [
        "c(",
        "-"
      ],
      [
        "C",
        "[C@@H]1O"
      ],
      [
        "C",
        "3"
      ],
      [
        "N=C(O)",
        "CC"
      ],
      [
        "C(C)",
        "C)"
      ],
      [
        "[C@H]1CC",
        "[C@H]2"
      ],
      [
        ".",
        "O"
      ],
      [
        ".",
        "[N"
      ],
      [
        "C=C",
        "1"
      ],
      [
        "1",
        "(C)"
      ],
      [
        "c(O)",
        "n"
      ],
      [
        "CCN",
        "("
      ],
      [
        "O[C@@H]",
        "1"
      ],
      [
        "4(C)",
        "[C@H]3"
      ],
      [
        "CC(C)",
        "="
      ],
      [
        "CO",
        "c1cc"
      ],
      [
        "/",
        "C("
      ],
      [
        "[C@@H](O)",
        "[C@H](O"
      ],
      [
        "C",
        "[C@@H]1"
      ],
      [
        "cc1",
        ")"
      ],
      [
        "a",
        "+]"
      ],
      [
        "C",
        "[C@@H]("
      ],
      [
        "COP(=O)([O-])",
        "O"
      ],
      [
        ".[N",
        "a+]"
      ],
      [
        "[C@H]",
        "6"
      ],
      [
        "CCCCCCCC",
        "CC"
      ],
      [
        "/C(C)=C",
        "/"
      ],
      [
        "CO",
        "c1cc("
      ],
      [
        "c2",
        "n"
      ],
      [
        "cc",
        "2)"
      ],
      [
        "cn",
        "c5"
      ],
      [
        "C",
        "[C@@]"
      ],
      [
        "N=C(O)",
        "[C@@H]("
      ],
      [
        "2",
        "]"
      ],
      [
        "[C@@H]1O",
        "[C@H](CO)"
      ],
      [
        "[C@H](",
        "N)"
      ],
      [
        "O[C@H](CO)",
        "[C@H](O)"
      ],
      [
        "CCCC",
        "C/C=C\\C/C=C\\"
      ],
      [
        "CCCC",
        "(C)"
      ],
      [
        "C=C(",
        "C)"
      ],
      [
        "=",
        "CC(=O)"
      ],
      [
        "[C@@H]3",
        "O)"
      ],
      [
        "CC",
        "C("
      ],
      [
        "CC[C@]",
        "4(C)[C@H]3"
      ],
      [
        "CC(C)=",
        "CCC"
      ],
      [
        "N",
        "="
      ],
      [
        "[N+]",
        "(=O)"
      ],
      [
        "C[C@H](O)",
        "[C@@H]("
      ],
      [
        "O[C@@H]",
        "5"
      ],
      [
        "[C@H](O)",
        "[C@@H]("
      ],
      [
        "CC(O)=N",
        "[C@@H]1"
      ],
      [
        "3",
        "+]"
      ],
      [
        "C",
        "=CC"
      ],
      [
        "[C@H]1",
        "O)"
      ],
      [
        "c1n",
        "cn"
      ],
      [
        "[NH",
        "3+]"
      ],
      [
        "[C@@H]3",
        "O"
      ],
      [
        "N",
        "[C@@H]("
      ],
      [
        "O[C@@H]",
        "1O"
      ],
      [
        "N=C([O-])",
        "CC"
      ],
      [
        "CCCC",
        "CC"
      ],
      [
        "c2",
        "c1"
      ],
      [
        "C=C",
        "\\"
      ],
      [
        "[C@H]1CC[C@H]2",
        "[C@@H]3"
      ],
      [
        ".",
        "[O"
      ],
      [
        "c(",
        "[O-])"
      ],
      [
        "CC",
        "/C=C(\\C)"
      ],
      [
        "P(=O)([O-])",
        "[O-]"
      ],
      [
        "Br",
        ")"
      ],
      [
        "C",
        "[C@H]1O"
      ],
      [
        "c",
        "6"
      ],
      [
        "[C@H]3",
        "O[C@@H](n"
      ],
      [
        "N=C(O)CC",
        "N=C(O)"
      ],
      [
        "C",
        "/C=C/"
      ],
      [
        "[C@H]3O[C@@H](n",
        "4"
      ],
      [
        "SCC",
        "N=C(O)CCN=C(O)"
      ],
      [
        "[C@H](",
        "O[C@@H]2"
      ],
      [
        "O",
        "=C1"
      ],
      [
        "CCCC",
        "CCC"
      ],
      [
        "[C@@H]4",
        "O)"
      ],
      [
        "[C@@H](O)",
        "[C@H]1O"
      ],
      [
        "[",
        "S"
      ],
      [
        "[C@@H](O",
        "[C@H]2"
      ],
      [
        "-]",
        ".["
      ],
      [
        "CC/C(C)=C/",
        "CC/C(C)=C/"
      ],
      [
        "c(",
        "=N)"
      ],
      [
        "c2cc",
        "("
      ],
      [
        "CCO",
        "CCO"
      ],
      [
        "5",
        ")"
      ],
      [
        "SCC",
        "N=C([O-])CC"
      ],
      [
        "SCCN=C([O-])CC",
        "N=C([O-])"
      ],
      [
        "+",
        "2]"
      ],
      [
        "O[C@@H](C)",
        "[C@@H](O)[C@@H](O)"
      ],
      [
        "(O)",
        "("
      ],
      [
        "[C@H]4",
        "O[C@H](CO)[C@@H](O)[C@H](O)"
      ],
      [
        "[C@H]2",
        "O"
      ],
      [
        "Cc1",
        "cn"
      ],
      [
        "CN",
        "1"
      ],
      [
        "CCCCCCCC",
        "/C=C\\"
      ],
      [
        "[C@@H](O)[C@H](O)",
        "[C@H]1O"
      ],
      [
        "CC[C@]",
        "12C"
      ],
      [
        "N",
        "1"
      ],
      [
        "N",
        "=C"
      ],
      [
        "[C@@H](",
        "CO)"
      ],
      [
        "[O-])",
        "=N"
      ],
      [
        "N",
        "("
      ],
      [
        "CC",
        "[N+](C)"
      ],
      [
        "[C@H]4",
        "O)"
      ],
      [
        "CC1",
        "(C)"
      ],
      [
        "CC(C)",
        "C)"
      ],
      [
        "%",
        "1"
      ],
      [
        "S",
        ")"
      ],
      [
        "[N+](=O)",
        "[O-])"
      ],
      [
        "SCCN=C(O)CCN=C(O)",
        "[C@H](O)C(C)(C)COP(=O)(O)OP(=O)(O)OC[C@H]1O[C@@H](n2cnc3c(N)ncnc32)[C@H](O)[C@@H]1O"
      ],
      [
        "2",
        "3"
      ],
      [
        "C(O)=N",
        "[C@H]("
      ],
      [
        "C",
        "c1ccc("
      ],
      [
        "CC(=O)",
        "[O-])"
      ],
      [
        "/C(",
        "=C"
      ],
      [
        "[C@@H](",
        "CO"
      ],
      [
        "SCCN=C([O-])CCN=C([O-])",
        "[C@H](O)C(C)(C)COP(=O)(O)OP(=O)(O)OC[C@H]1O[C@@H](n2cnc3c(N)ncnc32)[C@H](O)[C@@H]1O"
      ],
      [
        ".O",
        ".O"
      ],
      [
        "OC",
        "[C@H]("
      ],
      [
        "S(=O)(=O)",
        "[O-])"
      ],
      [
        "CO",
        "c1ccc("
      ],
      [
        "c2",
        "[nH]"
      ],
      [
        "CC(C)=CCC",
        "/C(C)=C/"
      ],
      [
        "cc",
        "4"
      ],
      [
        "CC",
        "[C@@H]1"
      ],
      [
        "C(=N)",
        "O)"
      ],
      [
        "CCCCCCCCCCCC",
        "CC"
      ],
      [
        "[C@]",
        "3"
      ],
      [
        "c2cc",
        "ccc1"
      ],
      [
        "CC/C(C)=C\\CC/C(C)=C\\",
        "CC/C(C)=C\\CC/C(C)=C\\"
      ],
      [
        "C",
        "c1ccccc1)"
      ],
      [
        "[C@@H]2",
        "O"
      ],
      [
        "SCCN=C(O)CCN=C(O)[C@H](O)C(C)(C)COP(=O)(O)OP(=O)(O)OC[C@H]1O[C@@H](n2cnc3c(N)ncnc32)[C@H](O)[C@@H]1O",
        "P(=O)(O)O"
      ],
      [
        "O[C@H](CO)",
        "[C@@H](O)"
      ],
      [
        "P(=O)([O-])",
        "[O-])"
      ],
      [
        ".[C",
        "l"
      ],
      [
        "[C@H]2",
        "O)[C@H](O)"
      ],
      [
        ".[O",
        "]"
      ],
      [
        "c1",
        "2"
      ],
      [
        "O=",
        "P"
      ],
      [
        "CCCC",
        "C"
      ],
      [
        "COP(=O)([O-])O",
        "CC[N+](C)"
      ],
      [
        "c3ccccc3",
        ")"
      ],
      [
        "N",
        "2"
      ],
      [
        "CC",
        "S"
      ],
      [
        "C",
        "#"
      ],
      [
        "[C@@]",
        "(C)("
      ],
      [
        "P(=O)(O)OC",
        "[C@H]3O[C@@H](n4"
      ],
      [
        "SCCN=C([O-])CCN=C([O-])[C@H](O)C(C)(C)COP(=O)(O)OP(=O)(O)OC[C@H]1O[C@@H](n2cnc3c(N)ncnc32)[C@H](O)[C@@H]1O",
        "P(=O)([O-])[O-]"
      ],
      [
        "c3",
        "c("
      ],
      [
        "[C@H]1O",
        "[C@H](CO)"
      ],
      [
        "c2cc",
        "(O)"
      ],
      [
        "CC(C)",
        "(C)"
      ],
      [
        "c3cc",
        "c("
      ],
      [
        "[C@H](O)[C@H](O)",
        "CO)O"
      ],
      [
        "CC",
        "C(=O)[O-])"
      ],
      [
        "cc",
        "(C)"
      ],
      [
        ".",
        "Cl"
      ],
      [
        "c1cc",
        "c(O)"
      ],
      [
        "1",
        "(O)"
      ],
      [
        "C",
        "=O)"
      ],
      [
        "C1",
        "=C"
      ],
      [
        "[C@H](",
        "[C@H](O)[C@H](O)CO)O"
      ],
      [
        "2",
        "("
      ],
      [
        "[C@@H](O",
        "[C@H]3"
      ],
      [
        "O=",
        "S(=O)"
      ],
      [
        "C(F)(F)",
        "F)"
      ],
      [
        "C(C)",
        "C"
      ],
      [
        "C",
        "[C@@H]3O"
      ],
      [
        "CC",
        "C(=O)"
      ],
      [
        "n",
        "4"
      ],
      [
        "c(O)cc",
        "(O)"
      ],
      [
        "/C=C",
        "/C=C\\"
      ],
      [
        "[C@H]2",
        "N=C(C)O)"
      ],
      [
        "CC/C=C\\",
        "C/C=C\\C/C=C\\"
      ],
      [
        "C",
        "[C@H]1"
      ],
      [
        "O[C@@H]2",
        "CO)"
      ],
      [
        "c2c(",
        "c1)"
      ],
      [
        "O",
        "1"
      ],
      [
        "c3",
        ")"
      ],
      [
        "O[C@H](CO)",
        "[C@@H](O)[C@@H]1O"
      ],
      [
        "2",
        "c("
      ],
      [
        "[C@@H](",
        "[C@H](O)"
      ],
      [
        "O[C@H](",
        "C)"
      ],
      [
        "nc(",
        "=N)"
      ],
      [
        "C[C@H](",
        "N)"
      ],
      [
        "CC(C)",
        "("
      ],
      [
        "nc(=N)",
        "[nH]"
      ],
      [
        "5",
        "(C)"
      ],
      [
        "O[C@@H]",
        "6"
      ],
      [
        "]",
        ".["
      ],
      [
        "C",
        "[C@@H](C)"
      ],
      [
        "CCC",
        "1"
      ],
      [
        "[NH3+]",
        ")"
      ],
      [
        "[C@H]3",
        "N=C(C)O)"
      ],
      [
        "(C(=O)O)",
        "C[C@H](O)[C@@H]("
      ],
      [
        "C(=O)N",
        "1"
      ],
      [
        "[C@@H]1",
        "CC"
      ],
      [
        "CC(",
        "=N)"
      ],
      [
        "c(O)",
        "c("
      ],
      [
        "c2cc",
        "c(O)cc"
      ],
      [
        "C1",
        "=O"
      ],
      [
        "CCCCCCCCCCCC",
        "CCC"
      ],
      [
        ".[Cl",
        "-]"
      ],
      [
        "c1",
        "c("
      ],
      [
        "(C)",
        "(O)"
      ],
      [
        "c2cc",
        "3"
      ],
      [
        "[C@@H]1O",
        "[C@H]("
      ],
      [
        "c(=N)",
        "n"
      ],
      [
        "[C@H]",
        "7"
      ],
      [
        "O",
        "2)"
      ],
      [
        "ccc1",
        "O"
      ],
      [
        "n",
        "2"
      ],
      [
        "cc",
        "1O"
      ],
      [
        "([O-])",
        "=N"
      ],
      [
        "1",
        "("
      ],
      [
        "CCCCCCCCCC",
        "C)"
      ],
      [
        "O[C@H](CO)[C@H](O)",
        "[C@H]("
      ],
      [
        "N=C(O)",
        "C"
      ],
      [
        "=C(C)",
        "C)"
      ],
      [
        "COP(=O)(O)O",
        "[C@H]3"
      ],
      [
        "CN",
        "(C)"
      ],
      [
        "O[C@H](CO",
        "C(=O)"
      ],
      [
        "n",
        "("
      ],
      [
        "N=",
        "c1n"
      ],
      [
        "[C@H]2",
        "O[C@@H](n"
      ],
      [
        "[C@H]2O[C@@H](n",
        "3"
      ],
      [
        "c(O)",
        "nc(=N)[nH]"
      ],
      [
        "CC(O)=N[C@H]1",
        "[C@H](O[C@H]2"
      ],
      [
        "O[C@H](CO)[C@@H](",
        "O[C@@H]3"
      ],
      [
        "O",
        "=C"
      ],
      [
        "=C",
        "2"
      ],
      [
        "[C@H]3",
        "O[C@H](CO)[C@@H](O)[C@H](O)"
      ],
      [
        "[C@@H](O)[C@H](",
        "O[C@@H]2"
      ],
      [
        "C",
        "[C@H]2"
      ],
      [
        "(C(=O)O)C[C@H](O)[C@@H](",
        "N=C(C)O)"
      ],
      [
        "c5",
        "cc"
      ],
      [
        "cc(",
        "OC)"
      ],
      [
        "c[nH]",
        "c2ccccc1"
      ],
      [
        "c1cc",
        "(O)"
      ],
      [
        "CC[C@]",
        "2(C)"
      ],
      [
        "CC/C=C(\\C)",
        "CC/C=C(\\C)"
      ],
      [
        "(O)",
        "O"
      ],
      [
        "CC[C@]4(C)[C@H]3",
        "CC[C@]12C"
      ],
      [
        "N=C(O)[C@@H](",
        "N)"
      ],
      [
        "[C@H]4O[C@H](CO)[C@@H](O)[C@H](O)",
        "[C@@H]4"
      ],
      [
        "2",
        "+]"
      ],
      [
        "C(=N)",
        "N)"
      ],
      [
        "C[C@]",
        "12"
      ],
      [
        "[C@@H](CO)O",
        "[C@H]1O"
      ],
      [
        "c3cc",
        "("
      ],
      [
        "CCCC(=O)",
        "O"
      ],
      [
        "C",
        "[C@H](O"
      ],
      [
        "cc",
        "c4"
      ],
      [
        "[C@H](O)[C@H](O)",
        "[C@H]1O"
      ],
      [
        "O[C@H](CO)",
        "[C@@H](O[C@@H]2"
      ],
      [
        "CC",
        "[C@H](C)"
      ],
      [
        "CC",
        "2"
      ],
      [
        "[n",
        "+]"
      ],
      [
        "c3cc",
        "(O)"
      ],
      [
        "[NH",
        "2+]"
      ],
      [
        "CC",
        "C(=O)O"
      ],
      [
        "CCCCC/C=C\\C/C=C\\",
        "C/C=C\\C/C=C\\"
      ],
      [
        "CC",
        "C(O)=N"
      ],
      [
        "CCCCCCCCCCCCCCCC",
        "CCCCCCCC"
      ],
      [
        "CN",
        "("
      ],
      [
        "C[C@@H]3O",
        "P(=O)(O)OC[C@H]3O[C@@H](n4"
      ],
      [
        "CC(=N)",
        "O)"
      ],
      [
        "3",
        "]"
      ],
      [
        "CC(=O)",
        "[O-]"
      ],
      [
        "[C@@]",
        "2(C)"
      ],
      [
        "cn",
        "c4"
      ],
      [
        "O[C@@H]3",
        "CO)"
      ],
      [
        "c2ccc(O)cc",
        "2)"
      ],
      [
        "CC",
        "[C@H]1"
      ],
      [
        "CCCC",
        "N)"
      ],
      [
        "CC",
        "C(C)"
      ],
      [
        "O[C@@H]3",
        "COP(=O)(O)O[C@H]3"
      ],
      [
        "c",
        "s"
      ],
      [
        "[C@H]4",
        "N=C(C)O)"
      ],
      [
        "O[C@@H](C)[C@@H](O)[C@@H](O)",
        "[C@@H]2O)"
      ],
      [
        "C",
        "[C@@H]4"
      ],
      [
        "[nH]",
        "c("
      ],
      [
        "C(=O)N",
        "2"
      ],
      [
        ".[O]",
        ".[O]"
      ],
      [
        "[C@H](",
        "OC"
      ],
      [
        "[C@@H](O",
        "C(=O)"
      ],
      [
        "(C(=O)O)C[C@H](O)[C@@H](N=C(C)O)",
        "[C@H]([C@H](O)[C@H](O)CO)O"
      ],
      [
        "/C=C",
        "/C(C)=C"
      ],
      [
        "CCN",
        "1"
      ],
      [
        "cc",
        "c(=N)n"
      ],
      [
        "CCC",
        "[C@H]1"
      ],
      [
        "C",
        "[C@@H]2"
      ],
      [
        "O",
        "C("
      ],
      [
        "c4",
        "=O)"
      ],
      [
        "[C@H](O",
        "[C@H]3"
      ],
      [
        "CC(O)=N",
        "[C@@H]("
      ],
      [
        "=",
        "S)"
      ],
      [
        "C",
        "2)"
      ],
      [
        "c1ccc(",
        "Cl)"
      ],
      [
        "c(=O)",
        "n"
      ],
      [
        "C(F)(F)",
        "C(F)(F)"
      ],
      [
        "2",
        "1"
      ],
      [
        "O[C@H](CO)[C@@H](O)[C@H](O)",
        "[C@H]2O)"
      ],
      [
        "[C@@H](O)",
        "[C@@H](CO)O"
      ],
      [
        "CCCCCCC",
        "/C=C\\"
      ],
      [
        "c(O)",
        "c1"
      ],
      [
        "c(O)n",
        "c4=O)"
      ],
      [
        "CCCCCCCC/C=C\\",
        "CCCCCCCC(=O)"
      ],
      [
        "/C(=C",
        "\\"
      ],
      [
        "CC",
        "[C@H]("
      ],
      [
        "Cc1cc",
        "c(O)"
      ],
      [
        "OC",
        "1"
      ],
